// Подія submit

// Відправлення форми відбувається:

// при кліку на кнопку з атрибутом type="submit"
// Або

// при натисканні клавіші Enter під час перебування в будь-якому її текстовому полі форми

// Подія submit відбувається безпосередньо на формі (тег form), тому обробник подій слід встановлювати саме на ній.

// const form = document.querySelector("form");

// form.addEventListener("submit", event => {
// 	// ...
// });

// Деякі події викликають дію браузера, вбудовану за замовчуванням як реакція на певний тип події. Наприклад, клік на посиланні ініціює перехід на нову адресу, зазначену в href, а відправлення форми перезавантажує сторінку.

// Найчастіше ця поведінка небажана і її необхідно скасувати. Для скасування дії браузера за замовчуванням в об'єкта події є стандартний метод preventDefault().

// const form = document.querySelector("form");

// form.addEventListener("submit", event => {
// 	event.preventDefault();
// });

// Подію submit можна застосувати для валідації (перевірки) форми перед відправленням, оскільки на об'єкті події існує багато корисних властивостей, пов'язаних з елементами форми.

/////////////////////

// Подія change

// Подія change відбувається після зміни елемента форми.

// Для текстових полів або textarea подія відбудеться не на кожному введенні символу, а після втрати фокусу. Це не завжди зручно. Уяви, що користувач набирає щось у текстовому полі — подія відсутня. Щойно фокус пропав, відбудеться подія change.

// Для інших елементів, наприклад, select, чекбоксів і радіокнопок, подія change спрацьовує відразу під час вибору значення.

// Зверни увагу на корисні властивості при роботі з елементом <select> у прикладі.

// Визнач, що зберігається у властивостях value, selectedIndex і options.

////////////////////

// Подія input

// Подія input відбувається тільки на текстових полях і textarea.

// Вона створюється щоразу при зміні значення елемента, не чекаючи втрати фокусу. На практиці input — це найголовніша подія для роботи з текстовими полями форми.

// Порівняємо події input і change на текстових полях і textarea

// Подія input:

// відбувається при кожній зміні значення (при введенні або видаленні)
// не залежить від втрати фокусу

// Подія change:

// відбувається після втрати фокусу за умови, що відбулася зміна значення в елементі

//////////////////////

// Подія focus і blur

// Елемент отримує фокус під час кліку миші або переходу клавішею Tab.

// Момент отримання і втрати фокусу дуже важливий. Отримуючи фокус, ми можемо завантажити дані для автозаповнення, почати відстежувати зміни тощо.

// Під час втрати фокусу — перевірити введені дані.

// подія focus відбувається під час фокусування на елементі
// подія blur відбувається при втраті фокусу, наприклад, користувач клікає в іншому місці екрана

// Активувати або скасувати фокус можна програмно.Для цього треба викликати в коді для елемента однойменні методи focus() і blur().

// Фокус може бути тільки на одному елементі сторінки за одиницю часу. Поточний елемент, на якому знаходиться фокус, доступний як document.activeElement.

// Більшість елементів не можуть отримати фокус. Наприклад, якщо клікнути по <div>, то фокусування на ньому не відбудеться, тому що це не інтерактивний елемент.